main.floors.MT01=
{
    "floorId": "MT01",
    "title": "福神花园 前段",
    "name": "福神花园 前段",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 1,
    "defaultGround": "grass",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "showImage",
            "code": 1,
            "image": "c1.png",
            "loc": [
                129,
                146
            ],
            "opacity": 1,
            "time": 1000
        },
        {
            "type": "sleep",
            "time": 2000
        },
        {
            "type": "hideImage",
            "code": 1,
            "time": 1000
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,11": [
            {
                "type": "freeBgm",
                "name": "prologue.mp3"
            },
            "\t[hero]咳咳……还没进来就被拦路的小莱姆暴打了一顿……",
            "\t[hero]这个花园……和我印象里不太一样啊……怎么遍地都是宝石和血瓶？",
            "\t[hero]而且，我好像能看穿怪物的能力。难道是梦里那本怪物手册的作用？",
            "\t[系统提示]不同于一般人，主角能够精确地看穿怪物能力，并预知自己将要受到的伤害。按x可以查看怪物信息。",
            {
                "type": "if",
                "condition": "core.getFlag('hard', -1) == 1",
                "true": [
                    {
                        "type": "choices",
                        "text": "是否需要介绍魔塔类游戏的战斗规则？",
                        "choices": [
                            {
                                "text": "不用介绍",
                                "color": [
                                    255,
                                    255,
                                    255,
                                    1
                                ],
                                "action": []
                            },
                            {
                                "text": "给我介绍一下规则",
                                "color": [
                                    255,
                                    255,
                                    255,
                                    1
                                ],
                                "action": [
                                    "魔塔类游戏的战斗是回合制，勇士攻击怪物1次，然后怪物攻击勇士1次，这是一个回合。",
                                    "每次攻击造成的伤害等于\r[red]攻击者的攻击力\r[white]减去\r[blue]防御者的防御力\r[white]。伤害数值即为对手生命值减少的数值，一方生命值归0时战斗结束。",
                                    "如果双方都无法对敌方造成伤害，则你无法对该怪物发起战斗。",
                                    "本游戏有护盾设定，护盾每场战斗都可以吸收一定量的伤害。比如你的护盾为3，则每场战斗的伤害值都会减少3点。",
                                    "一般来讲，游戏初期护盾的价值远远低于攻击或者防御，因为1点护盾每场战斗只能减少1点伤害，而这里1点攻击能够减少几十点伤害。更多的技巧就自己探索吧！"
                                ]
                            }
                        ]
                    }
                ],
                "false": []
            },
            {
                "type": "setValue",
                "name": "item:I_hp_score",
                "value": "1"
            },
            "\t[系统提示]本塔有生命上限，由于超出上限而无法获取的生命值可以用来计分。可以在道具栏里查看溢出生命值的数量。",
            {
                "type": "setValue",
                "name": "flag:hp_score",
                "value": "0"
            },
            {
                "type": "hide",
                "time": 500
            }
        ],
        "3,4": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "data": [
                "\t[hero]似乎是家里的长老在教导后辈，我还是不要去打扰了。",
                {
                    "type": "moveHero",
                    "time": 200,
                    "steps": [
                        "down"
                    ]
                }
            ]
        },
        "3,3": [
            "\t[莫家长老,N369]今天是实战练习，你们的对手就是这里的各种莱姆。这些莱姆不会主动攻击人，但你们还是要注意挑选合适的对手。在这个花园里，浅绿色的小莱姆最弱，之后按照红橙黄绿青蓝紫黑的顺序变强。我建议你们从最弱的开始，逐渐加大难度……",
            "\t[hero]似乎是家里的长老在教导后辈，我还是不要去打扰了。",
            {
                "type": "moveHero",
                "time": 200,
                "steps": [
                    "down",
                    "down"
                ]
            },
            {
                "type": "show",
                "loc": [
                    [
                        3,
                        4
                    ]
                ],
                "time": 0
            }
        ]
    },
    "changeFloor": {
        "12,6": {
            "floorId": "MT02",
            "loc": [
                0,
                6
            ],
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {
        "7,11": [
            "红色的宝石直接进入了莫逆的体内。",
            "\t[hero]这什么情况……等等，我感觉自己的\r[red]攻击力\r变强了！变强了整整一倍！",
            "\t[hero]这里还有其他颜色的宝石……还有血瓶！我之前梦中出现过的！",
            "\t[hero]哈哈，有这么多宝石和血瓶在地上摆着，看我如何暴打这些莱姆！",
            {
                "type": "if",
                "condition": "flag:hard==3",
                "true": [
                    "\t[系统提示]前方卡血警告，请注意每一个细节。另外，过了这个区域就不卡血了，不过如果成绩足够好会提供单独的榜单。"
                ]
            }
        ]
    },
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 32,  0,201,10004, 20, 20, 20],
    [  0,  0,  0,  0, 20, 32, 20, 20,  0,202,  0, 28, 20],
    [  0,  0,  0,369, 20,  0, 20, 20,  0, 20, 31,  0, 20],
    [  0,  0,  0,  0, 20,201,  0,  0, 31, 20, 20, 20, 20],
    [  0, 17, 17,  0, 20,  0, 20, 20,  0, 20,  0, 28, 20],
    [ 20,  0,  0, 30,  0,  0, 31,  0,  0,  0,201, 20, 20],
    [ 31,201, 20, 20, 20,201, 20, 20,201, 20,  0,202, 94],
    [ 20,  0, 20, 27,  0,  0, 20, 31, 29, 20,  0, 20, 20],
    [ 20, 32,  0, 20, 20, 20, 20, 20, 20,  0,201,  0, 31],
    [ 20, 20,201,  0, 31,  0,201,  0,202,  0, 20, 20, 20],
    [10004,  0,  0, 20,201, 20, 20,  0, 20,201,  0,202,  0],
    [ 31, 20,202, 20,  0, 20,  0, 27, 20,  0, 20, 20, 31],
    [  0, 31,  0, 20, 32, 20,  0, 20, 20, 29, 20, 31,  0]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10072,10073,10074,10075,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [10040,10041,10042,10043,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10048,10049,10050,10051,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10056,10057,10058,10059,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10064,10065,10066,10067,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgm": "11-13.mp3"
}