main.floors.MT10=
{
    "floorId": "MT10",
    "title": "福神花园 后段",
    "name": "福神花园 后段",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 1,
    "defaultGround": "grass",
    "bgm": "11-13.mp3",
    "firstArrive": [
        {
            "type": "loadBgm",
            "name": "13-15.mp3"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "4,6": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "data": []
        },
        "12,6": [
            {
                "type": "if",
                "condition": "core.status.hero.lv >= 4",
                "true": [
                    {
                        "type": "if",
                        "condition": "core.status.hero.experience >= 10",
                        "true": [
                            {
                                "type": "changeFloor",
                                "floorId": "MT11",
                                "loc": [
                                    0,
                                    9
                                ],
                                "direction": "right",
                                "time": 1000
                            }
                        ],
                        "false": [
                            "\t[hero]\r[yellow]粽子湖畔\r[white]离这里挺远的，去了就轻易回不来了，先把剩下的怪清了吧。",
                            {
                                "type": "moveHero",
                                "time": 100,
                                "steps": [
                                    "left"
                                ]
                            },
                            "系统提示：可以利用浏览地图功能查找漏掉的怪物，快捷键是PgUp和PgDn。"
                        ]
                    }
                ],
                "false": [
                    "\t[hero]\r[yellow]粽子湖畔\r[white]离这里挺远的，去了就轻易回不来了，先把剩下的怪清了吧。",
                    {
                        "type": "moveHero",
                        "time": 100,
                        "steps": [
                            "left"
                        ]
                    },
                    "系统提示：可以利用浏览地图功能查找漏掉的怪物，快捷键是PgUp和PgDn。"
                ]
            }
        ]
    },
    "changeFloor": {
        "0,6": {
            "floorId": "MT09",
            "loc": [
                12,
                6
            ],
            "time": 0
        }
    },
    "afterBattle": {
        "9,6": [
            {
                "type": "openDoor",
                "loc": [
                    11,
                    6
                ]
            },
            {
                "type": "sleep",
                "time": 500
            },
            "\b[up,hero]\t[hero]这里最强的金莱姆也被我打败了……这样下去说不定我真能获得我梦寐以求的强大力量。",
            {
                "type": "show",
                "loc": [
                    [
                        4,
                        6
                    ]
                ],
                "time": 500
            },
            {
                "type": "changePos",
                "direction": "left"
            },
            "\b[up,4,6]\t[莫家长老,N364]哈哈，打得不错。",
            "\b[up,hero]\t[hero]长老？……您找我有事吗？",
            "\b[up,4,6]\t[莫家长老,N364]有人向我报告说这花园的莱姆被消灭了大半，怀疑有人蓄意破坏，我是前来调查的。",
            "\b[up,hero]\t[hero]啊……这个……确实是我做的……",
            "\b[up,4,6]\t[莫家长老,N364]哈哈，不用紧张，我观察的你刚才的战斗，应该是刚晋入萌新四阶不久，在这里打莱姆不违反规矩。",
            "\b[up,4,6]\t[莫家长老,N364]不过我很好奇，一般的萌新四阶打那么多莱姆必然早已力竭，你是怎么做到的？",
            "\b[up,hero]\t[hero]（……还是不要把宝石和血瓶的事情说出去比较好，得找个理由搪塞过去）",
            "\b[up,hero]\t[hero]这个……不知为何感觉这些莱姆的攻击比起以往要弱一些，可能它们染上了什么病？",
            "\b[up,4,6]\t[莫家长老,N364]你这小家伙还真是谦虚。不过既然你说它们可能患病，我需要立即上报，请求家主派人调查。告辞。",
            {
                "type": "hide",
                "loc": [
                    [
                        4,
                        6
                    ]
                ],
                "time": 500
            },
            {
                "type": "sleep",
                "time": 500
            },
            "\b[up,hero]\t[hero]糟糕……虽然应付过去了，但是惊动家主的话事情就麻烦了……",
            "\b[up,hero]\t[hero]算了不想那些了，继续修炼吧。我要让他们大吃一惊！",
            "\b[up,hero]\t[hero]接下来去哪呢……对了，听说家里好多人喜欢去\r[yellow]粽子湖畔\r[white]修炼，就去那里看看吧。"
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0, 20,  0,248, 30,  0, 28,  0,10007,  0,10007],
    [  0,  0,  0, 20, 32,10023,  0,10007,  0,10012,  0,10023,  0],
    [  0,  0,  0, 20,  0,30020, 34,  0, 29,  0,10007,  0,10007],
    [  0,  0,  0, 20, 27,  0, 20, 20, 20, 20, 20, 20, 20],
    [  0, 17, 17, 20,10004,203, 20,  0,  0,  0,  0,  0, 20],
    [  0,  0,  0,  0,  0,  0, 20,  0,  0,  0,  0,  0, 20],
    [ 92,  0,  0,  0,364,  0,  0,  0,  0,233,  0, 85, 94],
    [  0,  0,  0,  0,  0,  0, 20,  0,  0,  0,  0,  0, 20],
    [  0,  0,  0, 20,10004,203, 20,  0,  0,  0,  0,  0, 20],
    [  0,  0,  0, 20, 28,  0, 20, 20, 20, 20, 20, 20, 20],
    [  0,  0,  0, 20,  0,30020, 34,  0, 29,  0,10007,  0,10007],
    [  0,  0,  0, 20, 32,10023,  0,10007,  0,10012,  0,10023,  0],
    [  0, 17, 17, 20,  0,248, 30,  0, 27,  0,10007,  0,10007]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10072,10073,10074,10075,  0,  0,  0,146,146,146,146,146,  0],
    [  0,  0,  0,  0,  0,  0,  0,146,146,146,146,146,  0],
    [146,146,146,146,  0,  0,  0,146,146,146,146,146,146],
    [  0,  0,  0,  0,  0,  0,  0,146,146,146,146,146,  0],
    [  0,  0,  0,  0,  0,  0,  0,146,146,146,146,146,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10072,10073,10074,10075,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [10040,10041,10042,10043,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10048,10049,10050,10051,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10056,10057,10058,10059,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10064,10065,10066,10067,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10040,10041,10042,10043,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10048,10049,10050,10051,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10056,10057,10058,10059,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10064,10065,10066,10067,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
]
}