main.floors.MT10=
{
    "floorId": "MT10",
    "title": "福神花园 后段",
    "name": "福神花园 后段",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 1,
    "defaultGround": "grass",
    "bgm": "11-13.mp3",
    "firstArrive": [
        {
            "type": "loadBgm",
            "name": "13-15.mp3"
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[hero]\b[up,hero]这……竟然是罕见的金莱姆……",
        {
            "type": "callBook"
        },
        "\t[hero]\b[up,hero]萌新四段吗……而且比同为萌新四段的银莱姆还厉害一点。不过以我现在的升级速度，打完前面那些莱姆应该差不多也能达到萌新四段了，打败它并非难事。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "12,6": [
            {
                "type": "if",
                "condition": "core.status.hero.lv >= 4",
                "true": [
                    {
                        "type": "if",
                        "condition": "core.status.hero.experience >= 10",
                        "true": [
                            {
                                "type": "sleep",
                                "time": 500
                            },
                            {
                                "type": "setVolume",
                                "value": 0,
                                "time": 2000,
                                "async": true
                            },
                            "（幼女的尖叫声）啊~~~ ",
                            {
                                "type": "changePos",
                                "direction": "left"
                            },
                            "\t[hero]\b[up,hero]等等，刚才是什么声音？",
                            {
                                "type": "jumpHero",
                                "loc": [
                                    6,
                                    6
                                ],
                                "time": 370
                            },
                            {
                                "type": "moveHero",
                                "time": 100,
                                "steps": [
                                    "left",
                                    "left",
                                    "left",
                                    "left",
                                    "left",
                                    "left"
                                ]
                            },
                            {
                                "type": "changeFloor",
                                "floorId": "MT0A",
                                "loc": [
                                    6,
                                    12
                                ],
                                "direction": "up",
                                "time": 1000
                            }
                        ],
                        "false": [
                            "\t[hero]\r[yellow]粽子湖畔\r[white]离这里挺远的，去了就轻易回不来了，先把剩下的怪清了吧。",
                            {
                                "type": "moveHero",
                                "time": 100,
                                "steps": [
                                    "left"
                                ]
                            },
                            "系统提示：可以利用浏览地图功能查找漏掉的怪物，快捷键是PgUp和PgDn。"
                        ]
                    }
                ],
                "false": [
                    "\t[hero]\r[yellow]粽子湖畔\r[white]离这里挺远的，去了就轻易回不来了，先把剩下的怪清了吧。",
                    {
                        "type": "moveHero",
                        "time": 100,
                        "steps": [
                            "left"
                        ]
                    },
                    "系统提示：可以利用浏览地图功能查找漏掉的怪物，快捷键是PgUp和PgDn。"
                ]
            }
        ],
        "11,6": [
            "这里是漏怪检测，请清光前面的怪物再前进。",
            {
                "type": "if",
                "condition": "core.status.hero.lv >= 4",
                "true": [
                    {
                        "type": "if",
                        "condition": "core.status.hero.experience >= 10",
                        "true": [
                            "怪物已清完！",
                            {
                                "type": "hide",
                                "time": 0
                            }
                        ],
                        "false": [
                            "\t[hero]前面好像还有莱姆没有打，暂时不要继续前进了吧……",
                            "系统提示：可以利用浏览地图功能查找漏掉的怪物，快捷键是PgUp和PgDn。",
                            {
                                "type": "if",
                                "condition": "core.platform.isPC",
                                "true": [
                                    "单击地图可以瞬移，用来快速赶路。"
                                ],
                                "false": []
                            }
                        ]
                    }
                ],
                "false": [
                    "\t[hero]前面好像还有莱姆没有打，暂时不要继续前进了吧……",
                    "系统提示：可以利用浏览地图功能查找漏掉的怪物，快捷键是PgUp和PgDn。",
                    {
                        "type": "if",
                        "condition": "core.platform.isPC",
                        "true": [
                            "单击地图可以瞬移，用来快速赶路。"
                        ],
                        "false": []
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "0,6": {
            "floorId": "MT09",
            "loc": [
                12,
                6
            ],
            "time": 0
        }
    },
    "afterBattle": {
        "9,6": [
            {
                "type": "sleep",
                "time": 500
            },
            "\t[hero]\b[up,hero]这里最强的金莱姆也被我打败了……这样下去说不定我真能获得我梦寐以求的强大力量。"
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0, 20,  0,248, 30,  0, 28,  0,10007,  0,10007],
    [  0,  0,  0, 20, 32,10023,  0,10007,  0,10012,  0,10023,  0],
    [  0,  0,  0, 20,  0,30020, 34,  0, 29,  0,10007,  0,10007],
    [  0,  0,  0, 20, 27,  0, 20, 20, 20, 20, 20, 20, 20],
    [  0, 17, 17, 20,10004,203, 20,  0,  0,  0,  0,  0, 20],
    [  0,  0,  0,  0,  0,  0, 20,  0,  0,  0,  0,  0, 20],
    [ 92,  0,  0,  0,  0,  0,  0,  0,  0,233,  0,384, 94],
    [  0,  0,  0,  0,  0,  0, 20,  0,  0,  0,  0,  0, 20],
    [  0,  0,  0, 20,10004,203, 20,  0,  0,  0,  0,  0, 20],
    [  0,  0,  0, 20, 28,  0, 20, 20, 20, 20, 20, 20, 20],
    [  0,  0,  0, 20,  0,30020, 34,  0, 29,  0,10007,  0,10007],
    [  0,  0,  0, 20, 32,10023,  0,10007,  0,10012,  0,10023,  0],
    [  0, 17, 17, 20,  0,248, 30,  0, 27,  0,10007,  0,10007]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10072,10073,10074,10075,  0,  0,  0,146,146,146,146,146,  0],
    [  0,  0,  0,  0,  0,  0,  0,146,146,146,146,146,  0],
    [146,146,146,146,  0,  0,  0,146,146,146,146,146,146],
    [  0,  0,  0,  0,  0,  0,  0,146,146,146,146,146,  0],
    [  0,  0,  0,  0,  0,  0,  0,146,146,146,146,146,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10072,10073,10074,10075,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [10040,10041,10042,10043,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10048,10049,10050,10051,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10056,10057,10058,10059,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10064,10065,10066,10067,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10040,10041,10042,10043,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10048,10049,10050,10051,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10056,10057,10058,10059,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [10064,10065,10066,10067,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
]
}