main.floors.MT102=
{
    "floorId": "MT102",
    "title": "朝圣之路",
    "name": "朝圣之路",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        0,
        0,
        "dawn.jpg",
        false
    ],
    "item_ratio": 3000,
    "defaultGround": "white",
    "bgm": "7-9.mp3",
    "weather": [
        "fog",
        3
    ],
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "animate",
            "name": "wuyu",
            "loc": "hero"
        },
        "\t[伯力巫师,E554]你是何人？难道是来参拜伯力之神的？",
        "\t[hero]我没空跟你废话，受死吧！",
        "\t[伯力巫师,E554]你！休想！",
        {
            "type": "move",
            "loc": [
                1,
                9
            ],
            "time": 100,
            "keep": true,
            "steps": [
                "right"
            ]
        },
        "\t[hero]（伯力巫师……我看看跟普通的巫师有什么不一样）",
        {
            "type": "callBook"
        },
        "\t[hero]阻爆……若是换作一般人恐怕还真的会十分头疼，然而我有\r[yellow]魔化\r[white]和\r[yellow]跳跃\r[white]两种应对方法，今日谁都别想挡我！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "12,6": {
            "floorId": "MT103",
            "loc": [
                0,
                6
            ],
            "direction": "right",
            "time": 0
        },
        "0,9": {
            "floorId": "MT101",
            "loc": [
                12,
                9
            ],
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
    [ 28,454,157,  0,563,  0,157,  0,569,  0,454,  0,157],
    [243,157,157, 28,157, 27,157, 28,157,157,157, 27,157],
    [  0, 27,557,  0,157,  0,454,  0,157,  0,570,  0,157],
    [157,157,157, 34,157,157,568,157,157, 32,157,157,157],
    [454,157,  0,  0, 81,  0,  0, 28,  0,  0,563,  0,  0],
    [  0,157,571,157,157,157,243,157,157,157,157, 28,157],
    [ 27,563,  0,  0,157,349,  0,351,157,  0,563,  0, 94],
    [157,157,157, 27,563,  0,564,  0,556, 28,157,157,157],
    [  0, 30,157,  0,157,352,  0,350,157,  0, 82,455,349],
    [ 92,554,  0, 21,157,157,242,157,157, 33,157,157,570],
    [157,157,563,  0,243,  0, 28,  0,563,  0,157,350,  0],
    [ 27,242,  0,157,157,157,242,157,157,567,157,249,157],
    [454,157, 28,454,157,454, 27,454,157,  0, 27,  0, 29]
],
    "bgmap": [

],
    "fgmap": [

]
}