main.floors.MT10=
{
  "floorId": "MT10",
  "title": "福神花园 后段",
  "name": "福神花园 后段",
  "width": 13,
  "height": 13,
  "canFlyTo": true,
  "canUseQuickShop": true,
  "cannotViewMap": false,
  "images": [],
  "item_ratio": 1,
  "defaultGround": "grass",
  "bgm": "11-13.mp3",
  "firstArrive": [
    {
      "type": "loadBgm",
      "name": "boss0.mp3"
    },
    {
      "type": "loadBgm",
      "name": "13-15.mp3"
    },
    {
      "type": "sleep",
      "time": 500
    },
    "\t[hero]\b[up,hero]这……竟然是罕见的金莱姆……",
    {
      "type": "callBook"
    },
    "\t[hero]\b[up,hero]萌新四段吗……而且比同为萌新四段的银莱姆还厉害一点。不过以我现在的升级速度，打完前面那些莱姆应该差不多也能达到萌新四段了，打败它并非难事。"
  ],
  "eachArrive": [],
  "parallelDo": "",
  "events": {
    "12,6": [
      {
        "type": "if",
        "condition": "core.status.hero.lv >= 4",
        "true": [
          {
            "type": "if",
            "condition": "core.status.hero.experience >= 10",
            "true": [
              {
                "type": "sleep",
                "time": 500
              },
              {
                "type": "setVolume",
                "value": 0,
                "time": 2000,
                "async": true
              },
              {
                "type": "playSound",
                "name": "WomanScream.ogg"
              },
              "（幼女的尖叫声）啊~~~ ",
              {
                "type": "changePos",
                "direction": "left"
              },
              "\t[hero]\b[up,hero]等等，刚才是什么声音？",
              {
                "type": "jumpHero",
                "loc": [
                  6,
                  6
                ],
                "time": 370
              },
              {
                "type": "moveHero",
                "time": 100,
                "steps": [
                  "left",
                  "left",
                  "left",
                  "left",
                  "left",
                  "left"
                ]
              },
              {
                "type": "changeFloor",
                "floorId": "MT0A",
                "loc": [
                  6,
                  12
                ],
                "direction": "up",
                "time": 1000
              }
            ],
            "false": [
              "\t[hero]\r[yellow]粽子湖畔\r[white]离这里挺远的，去了就轻易回不来了，先把剩下的怪清了吧。",
              {
                "type": "moveHero",
                "time": 100,
                "steps": [
                  "left"
                ]
              },
              "\t[系统提示]可以利用浏览地图功能查找漏掉的怪物，快捷键是PgUp和PgDn。"
            ]
          }
        ],
        "false": [
          "\t[hero]\r[yellow]粽子湖畔\r[white]离这里挺远的，去了就轻易回不来了，先把剩下的怪清了吧。",
          {
            "type": "moveHero",
            "time": 100,
            "steps": [
              "left"
            ]
          },
          "\t[系统提示]可以利用浏览地图功能查找漏掉的怪物，快捷键是PgUp和PgDn。"
        ]
      }
    ],
    "11,6": [
      "这里是漏怪检测装置。正在检测是否有剩余怪物。",
      {
        "type": "function",
        "function": "function(){\ncore.checkMonster([\"MT01\", \"MT02\", \"MT03\", \"MT04\", \"MT05\", \"MT06\", \"MT07\", \"MT08\", \"MT09\", \"MT10\"]);\n}"
      },
      {
        "type": "if",
        "condition": "flag:remainMonsterCount>0",
        "true": [
          "共有${flag:remainMonsterCount}只怪物未清除。",
          "剩余怪物：${flag:remainMonsterInfo}",
          "\t[系统提示]可以利用浏览地图功能查找漏掉的怪物位置，快捷键是PgUp和PgDn。",
          {
            "type": "if",
            "condition": "core.platform.isPC",
            "true": [
              "单击地图可以瞬移，用来快速赶路。"
            ],
            "false": []
          }
        ],
        "false": [
          "怪物已清完！",
          "\t[系统提示]继续前进将无法再返回此区域，请及时清理地上的资源。",
          {
            "type": "if",
            "condition": "core.platform.isPC",
            "true": [
              "单击地图可以瞬移，用来快速赶路。"
            ],
            "false": []
          },
          {
            "type": "hide",
            "time": 0
          }
        ]
      }
    ]
  },
  "changeFloor": {
    "0,6": {
      "floorId": "MT09",
      "loc": [
        12,
        6
      ],
      "time": 0
    }
  },
  "afterBattle": {
    "9,6": [
      {
        "type": "sleep",
        "time": 500
      },
      "\t[hero]\b[up,hero]这里最强的金莱姆也被我打败了……这样下去说不定我真能获得我梦寐以求的强大力量。"
    ]
  },
  "afterGetItem": {},
  "afterOpenDoor": {},
  "cannotMove": {},
  "map": [
    [
      0,
      0,
      0,
      20,
      0,
      248,
      30,
      0,
      28,
      0,
      10023,
      0,
      10023
    ],
    [
      0,
      0,
      0,
      20,
      32,
      10040,
      0,
      10023,
      0,
      10027,
      0,
      10040,
      0
    ],
    [
      0,
      0,
      0,
      20,
      0,
      10041,
      34,
      0,
      29,
      0,
      10023,
      0,
      10023
    ],
    [
      0,
      0,
      0,
      20,
      27,
      0,
      20,
      20,
      20,
      20,
      20,
      20,
      20
    ],
    [
      0,
      17,
      17,
      20,
      10000,
      203,
      20,
      0,
      0,
      0,
      0,
      0,
      20
    ],
    [
      0,
      0,
      0,
      0,
      0,
      0,
      20,
      0,
      0,
      0,
      0,
      0,
      20
    ],
    [
      92,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      233,
      0,
      384,
      94
    ],
    [
      0,
      0,
      0,
      0,
      0,
      0,
      20,
      0,
      0,
      0,
      0,
      0,
      20
    ],
    [
      0,
      0,
      0,
      20,
      10000,
      203,
      20,
      0,
      0,
      0,
      0,
      0,
      20
    ],
    [
      0,
      0,
      0,
      20,
      28,
      0,
      20,
      20,
      20,
      20,
      20,
      20,
      20
    ],
    [
      0,
      0,
      0,
      20,
      0,
      10041,
      34,
      0,
      29,
      0,
      10023,
      0,
      10023
    ],
    [
      0,
      0,
      0,
      20,
      32,
      10040,
      0,
      10023,
      0,
      10027,
      0,
      10040,
      0
    ],
    [
      0,
      17,
      17,
      20,
      0,
      248,
      30,
      0,
      27,
      0,
      10023,
      0,
      10023
    ]
  ],
  "bgmap": [
    [
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      10001,
      10002,
      10003,
      10004,
      0,
      0,
      0,
      146,
      146,
      146,
      146,
      146,
      0
    ],
    [
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      146,
      146,
      146,
      146,
      146,
      0
    ],
    [
      146,
      146,
      146,
      146,
      0,
      0,
      0,
      146,
      146,
      146,
      146,
      146,
      146
    ],
    [
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      146,
      146,
      146,
      146,
      146,
      0
    ],
    [
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      146,
      146,
      146,
      146,
      146,
      0
    ],
    [
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      10001,
      10002,
      10003,
      10004,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ]
  ],
  "fgmap": [
    [
      10005,
      10006,
      10007,
      10008,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      10009,
      10010,
      10011,
      10012,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      10013,
      10014,
      10015,
      10016,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      10017,
      10018,
      10019,
      10020,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      10005,
      10006,
      10007,
      10008,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      10009,
      10010,
      10011,
      10012,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      10013,
      10014,
      10015,
      10016,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      10017,
      10018,
      10019,
      10020,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ]
  ]
}