main.floors.MT51=
{
    "floorId": "MT51",
    "title": "永夜平原",
    "name": "永夜平原",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 50,
    "defaultGround": "grass2",
    "firstArrive": [
        {
            "type": "setValue",
            "name": "flag:darkRatio",
            "value": "flag:darkRatio+0.01"
        }
    ],
    "eachArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.setFlag('bgLight', [\n\t[16, 104, 150],\n\t[16, 200, 150],\n]);\ncore.drawMap();\n}"
        }
    ],
    "parallelDo": "",
    "events": {
        "0,5": [
            "关于光明/黑暗属性的说明：\n\r[yellow]光明/黑暗\r[white]状态会影响所有受到和造成的伤害，包括普通攻击伤害和技能伤害。\n与\r[blue]严寒\r[white]状态对伤害的影响是乘法叠加。"
        ],
        "6,0": [
            {
                "type": "function",
                "function": "function(){\ncore.setFlag('bgLight', []);\n}"
            },
            {
                "type": "changeFloor",
                "floorId": "MT52",
                "loc": [
                    6,
                    12
                ],
                "time": 0
            }
        ],
        "12,10": [
            {
                "type": "function",
                "function": "function(){\ncore.setFlag('bgLight', []);\n}"
            },
            {
                "type": "changeFloor",
                "floorId": "MT55",
                "loc": [
                    0,
                    10
                ],
                "time": 0
            }
        ],
        "0,6": [
            {
                "type": "function",
                "function": "function(){\ncore.setFlag('bgLight', []);\n}"
            },
            {
                "type": "changeFloor",
                "floorId": "Area5_m",
                "loc": [
                    29,
                    11
                ],
                "time": 1000
            }
        ]
    },
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
    [152,152,152, 27, 32,80009, 91,60031, 32, 27,152,152,152],
    [152,152,152,409,80011,  0,  0, 27,80010,409,152,152,152],
    [152, 32,80009, 32, 27,407, 32,  0,80009,  0,152,152,152],
    [152, 27,80010,60030,60030,  0,60031,  0,407, 27,152,152,152],
    [152,407,  0,407,  0, 29,  0,408,80011, 32,152,152,152],
    [129,  0,  0,380,80010,80009,60031,  0,80009,60030,152,152,152],
    [ 89,  0,  0, 30,60030, 28,408,  0,408,  0,152,152,152],
    [152,408,  0,408,  0,80011,  0,10007,  0, 28,152,152,152],
    [152, 28,80010,  0, 28,  0,408, 28,80009,  0, 32,413, 32],
    [152, 32,80009,  0,  0,60030,  0,80010, 29,408,80010,  0,  0],
    [152,152,152,408, 32,80009,380,80009, 32,80009, 28,  0, 94],
    [152,152,152, 28,80011, 28,80009, 28,410, 32,60030,80009,60030],
    [152,152,152, 34,410,  0, 32,80011,380,410, 28,  0, 34]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [103,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [103,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgm": "21-23.mp3",
    "color": [
        0,
        0,
        0,
        0.5
    ]
}