main.floors.MT51=
{
    "floorId": "MT51",
    "title": "永夜平原",
    "name": "永夜平原",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 50,
    "defaultGround": "grass2",
    "firstArrive": [
        {
            "type": "setValue",
            "name": "flag:darkRatio",
            "value": "flag:darkRatio+0.01"
        },
        {
            "type": "function",
            "function": "function(){\ncore.setFlag('bgLight', [\n\t[16, 104, 150],\n\t[16, 200, 150],\n]);\ncore.drawMap();\n}"
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[熙枫,heroine]永夜平原被分为两部分，一部分由具有光明属性的莱姆族和行动迅捷的妖精族占领，而另一部分则主要是具有黑暗属性的莱姆和持盾莱姆一族。",
        "\t[hero]容我观察一下它们的能力……",
        {
            "type": "callBook"
        },
        "\t[hero]这什么光明黑暗属性看起来好令人头大，小姐姐有解决方法吗？",
        "\t[熙枫,heroine]……有倒是有，但是代价太大，你不会愿意用的。",
        "\t[熙枫,heroine]而且也没有必要解除这些状态，好好想一想怎么利用光明和黑暗属性来对付这些妖精和持盾莱姆吧。"
    ],
    "eachArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.setFlag('bgLight', [\n\t[16, 104, 150],\n\t[16, 200, 150],\n]);\ncore.drawMap();\n}"
        }
    ],
    "parallelDo": "",
    "events": {
        "0,5": [
            "关于光明/黑暗属性的说明：\n\r[yellow]光明/黑暗\r[white]状态会影响所有受到和造成的伤害，包括普通攻击伤害和技能伤害。\n与\r[blue]严寒\r[white]状态对伤害的影响是乘法叠加。\n所有伤害的影响都在计算护盾之前。"
        ],
        "0,6": [
            {
                "type": "function",
                "function": "function(){\ncore.setFlag('bgLight', []);\n}"
            },
            {
                "type": "setValue",
                "name": "flag:charge_atk",
                "value": "0"
            },
            {
                "type": "setValue",
                "name": "flag:last_direction",
                "value": "null"
            },
            {
                "type": "changeFloor",
                "floorId": "Area5_m",
                "loc": [
                    29,
                    11
                ],
                "time": 1000
            }
        ]
    },
    "changeFloor": {
        "12,10": {
            "type": "changeFloor",
            "floorId": "MT55",
            "loc": [
                0,
                10
            ],
            "time": 0
        },
        "6,0": {
            "type": "changeFloor",
            "floorId": "MT52",
            "loc": [
                6,
                12
            ],
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
    [152,152,152, 27, 32,80009, 91,60031,380, 27,152,152,152],
    [152,152,152,409,80011,  0,  0, 27,80010,418,152,152,152],
    [152, 32,80009, 31, 27,407, 32,  0,80009,  0,152,152,152],
    [152, 27,80010,60030,60030,  0,60031,  0,407, 27,152,152,152],
    [152,407,  0,407,  0, 29,  0,408,80011, 32,152,152,152],
    [129,  0,  0,380,80010,80009,60031,  0,80009,60030,152,152,152],
    [ 89,  0,  0, 30,60030, 28,408,  0,408,  0,152,152,152],
    [152,408,  0,408,  0,80011,  0,10007,  0, 28,152,152,152],
    [152, 28,80010,  0, 28,  0,408, 28,80009,  0, 32,413, 32],
    [152, 32,80009,  0,  0,60030,  0,80010, 29,408,80010,  0,  0],
    [152,152,152,408, 32,80009,380,80009, 32,80009, 28,  0, 94],
    [152,152,152, 28,80011, 28,80009, 28,410, 32,60030,80009,60030],
    [152,152,152, 32,410,  0, 34,80011,380,410, 28,  0, 34]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [103,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [103,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgm": "21-23.mp3",
    "color": [
        0,
        0,
        0,
        0.5
    ]
}