main.floors.MT5A=
{
    "floorId": "MT5A",
    "title": "永夜平原 中心",
    "name": "永夜平原 中心",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 50,
    "defaultGround": "grass2",
    "bgm": "21-23.mp3",
    "color": [
        0,
        0,
        0,
        0.5
    ],
    "weather": [],
    "firstArrive": [
        {
            "type": "setValue",
            "name": "flag:darkRatio",
            "value": "flag:darkRatio+0.01"
        },
        {
            "type": "function",
            "function": "function(){\ncore.setFlag('bgLight', [\n\t[400, 136, 150],\n\t[400, 272, 150],\n\t[144, 8, 150],\n\t[272, 8, 150],\n\t[144, 304, 250],\n]);\ncore.drawMap();\n}"
        },
        {
            "type": "sleep",
            "time": 1000
        },
        {
            "type": "animate",
            "name": "wuyu",
            "loc": "hero"
        },
        "\t[hero]这里好像就是迅捷妖精和持盾莱姆两族最强者聚集的地方了。",
        "\t[熙枫,heroine]利用好光明和黑暗状态，对付它们应该并非难事。"
    ],
    "eachArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.setFlag('bgLight', [\n\t[400, 136, 150],\n\t[400, 272, 150],\n\t[144, 8, 150],\n\t[272, 8, 150],\n\t[144, 304, 250],\n]);\ncore.drawMap();\n}"
        }
    ],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "12,6": {
            "floorId": "MT57",
            "loc": [
                0,
                6
            ],
            "direction": "right",
            "time": 0
        },
        "6,0": {
            "floorId": "MT54",
            "loc": [
                6,
                12
            ],
            "direction": "up",
            "time": 0
        }
    },
    "afterBattle": {
        "8,9": [
            {
                "type": "sleep",
                "time": 500
            },
            "\t[hero]……这玩意怎么是个智障还能掌握魔攻啊？魔攻不应该是智商很高的生物才能拥有的能力吗？",
            "\t[熙枫,heroine]其实智力也分为很多方面的，对魔法的领悟很深，不代表反应速度是正常的。",
            "\t[熙枫,heroine]这家伙应该是凭借着对魔法的领悟以及皮糙肉厚才当上这里的王，如今倒是便宜你了。"
        ],
        "3,5": [
            {
                "type": "sleep",
                "time": 500
            },
            "\t[hero]刚才这家伙的技能，好强……还好她攻防不高，不然可真是噩梦了。",
            "\t[熙枫,heroine]不知道她是怎么获得这么强大的黑暗力量的，可能是有什么奇遇吧。"
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
    [152,152,152,152,152,152, 91,152,152,152,152,152,152],
    [152, 34,152, 33,353,259,  0,152,  0,351, 34,152,152],
    [152,351,152,152,152,152, 31,152,353,  0,152,152,152],
    [152,353,152, 31,  0,356,  0,  0,259,152,152, 33,152],
    [152,  0,259,  0,152,152,259,  0,152,152,354,  0,152],
    [152,152,152,252,152,  0,353,152,152,  0,416,152,152],
    [152,357,  0, 22,152, 33,152,152,354,416,  0,  0, 94],
    [152,  0, 21,  0,357,152,152, 33,  0,152,  0, 31,152],
    [152, 34,  0,359,152,152,358,152,152,152,356,  0,152],
    [152,  0,360,152,152,359,  0, 22,417,  0,  0, 31,152],
    [152, 34,152,152,360,  0, 21,  0,152,152,152,416,152],
    [152,152,152, 34,  0, 34,  0,358,152, 34,351,354,152],
    [152,152,152,152,152,152,152,152,152,152,152,152,152]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,103,  0,  0,  0,103,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,103],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,103],
    [  0,  0,  0,  0,103,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
]
}