main.floors.MT61=
{
    "floorId": "MT61",
    "title": "主塔 61 层",
    "name": "61",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 1,
    "defaultGround": "grass2",
    "firstArrive": [],
    "eachArrive": [
        {
            "type": "pauseBgm"
        },
        {
            "type": "setValue",
            "name": "item:skill3",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "flag:curse_stack",
            "value": "0"
        },
        "没有了严寒诅咒效果，不再能【感受温暖】。",
        "\t[熙枫,heroine]咳咳……",
        "\t[hero]小姐姐？",
        "\t[熙枫,heroine]可恶……那些人……发现我们了……",
        "\t[hero]这……这么快？",
        "\t[熙枫,heroine]咳……应该是你跟叶芊交手的余波引起了他们的注意……",
        "\t[熙枫,heroine]我没事……不用担心我……就是传送被扰乱了。",
        "\t[hero]该死，是我太无能了，什么都帮不上……",
        {
            "type": "sleep",
            "time": 1000
        },
        {
            "type": "changePos",
            "direction": "left"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "changePos",
            "direction": "right"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "changePos",
            "direction": "up"
        },
        "\t[hero]……所以我们现在在哪？这附近怎么遍地都是红海境界的生物，感觉我谁都打不过……",
        "\t[熙枫,heroine]有点糟糕……我们应该是落入红海战场了。",
        "\t[熙枫,heroine]红海战场是权圣教和镇仙域两大巨头宗派厮杀的地方。这两大宗派理念不同，历来势同水火。",
        "\t[熙枫,heroine]权圣教的理念是封印自身部分实力去挑战弱者，以此来提升自己的战斗意志和经验。",
        "\t[hero]封印自身部分实力？",
        "\t[熙枫,heroine]没错，这样就可以使得较弱的对手成为强敌，来提升自己的战斗意志和经验。",
        "\t[熙枫,heroine]但是缺陷也很明显，无法发挥自身全部实力，等到真正需要全力以赴的时候，可能会发现自己对全部力量的掌握十分生疏。",
        "\t[hero]那镇仙域的理念呢？",
        "\t[熙枫,heroine]镇仙域的理念是竭尽全力挑战强者，不惜使用代价极大、甚至有强大后遗症的禁术，以此锻炼自己在危急时刻的意志。",
        "\t[熙枫,heroine]正因为如此，镇仙域之人意志极为强大，面对生命危险也不会被动摇心智。但是也有不少人真的就陨落在强敌面前。",
        "\t[hero]听起来都好极端啊，就不能取中庸之道吗？",
        "\t[熙枫,heroine]如果取中庸之道，这两大宗派也就不是现在这个样子了。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[hero]所以，就因为理念不合，这两大宗派就开战了？",
        "\t[熙枫,heroine]没错，而且是永无休止的战斗，除非一方承认对方的理念更有助于修炼。",
        "\t[熙枫,heroine]而这种事情几乎不可能发生，因为两大宗派的领袖，都在记录着自己宗派的弟子有多少能够在残酷的战场上生存下来，并最终达到血海境界，以此来衡量理念的好坏。双方已经打了不知道多少年月，仍未分出胜负。",
        "\t[hero]所以这么多人在这战场上送命，就为了验证谁的理念更好？",
        "\t[熙枫,heroine]站在两大领袖的角度上看，是这样的。",
        "\t[熙枫,heroine]对于那些在战场上厮杀的人，只有突破血海境界才是唯一的出路。因为，这战场被一种力量极其强大的界线包围，只有达到血海境界才有能力离开这里……这也是两大宗派防止逃兵的手段。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[hero]等等，只有血海境界才能离开这里，这岂不是说我们被困在这了？",
        "\t[熙枫,heroine]是的，所以情况很糟糕……那些人恐怕已经知道我们在红海战场了，我们的时间已经不多了。",
        "\t[hero]必须尽快达到血海境界吗……",
        "\t[熙枫,heroine]等你达到血海境界，突破到天外的世界，那些人将再也无法寻找到你的踪迹。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[熙枫,heroine]现在还是先考虑眼前吧。你应该已经感应到了，这片战场上有不少红海境界的野生生物，正好适合你修炼。",
        "\t[熙枫,heroine]但是这里的怪物对你来说都太强了，首先，还是先从这里逃走，然后再找寻合适的怪物挑战吧。",
        "\t[熙枫,heroine]我能感应到右侧的气息比较弱，出口应该在那边。",
        {
            "type": "resumeBgm"
        }
    ],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "12,5": {
            "floorId": "MT65",
            "loc": [
                0,
                5
            ],
            "time": 0
        },
        "0,5": {
            "floorId": "MT62",
            "loc": [
                12,
                5
            ],
            "time": 0
        },
        "6,0": {
            "floorId": "MT68",
            "loc": [
                6,
                12
            ],
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
    [154,154,154,154,  0,50019, 91,50011,  0,154,154,154,154],
    [154,154,154,154,  0,50011,223,  0,  0,154,154,154,154],
    [154,154,  0,  0,  0,  0,  0,  0,50019,  0,  0,154,154],
    [  0,  0,50010,50019,  0,  0,  0,  0,  0,50018,  0,  0,  0],
    [50018,  0,  0,  0,  0,50018,  0,50011,  0,50018,223,  0,  0],
    [ 92,223,  0,  0,  0,  0,50019,  0,  0,  0,  0,  0, 94],
    [  0,  0,50011,  0,50018,  0,  0,  0,  0,50010,223,  0,  0],
    [154,  0,  0,50019,  0,  0,  0,  0,50019,  0,  0,  0,154],
    [154,154,154,154,  0,50018,  0,  0,  0,154,154,154,154],
    [154,154,154,154,  0,  0,50011,  0,  0,154,154,154,154],
    [218,154,154,154,  0,  0,  0,  0,50018,154,154,154,154],
    [220,241,154,154,50010,  0,  0,  0,427,154,154,154,154],
    [323,227,154,154,  0,  0,  0,  0,  0,154,154,154,154]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,50001,50001,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,50036,  0,  0,  0,  0,  0,  0,  0,  0,  0,50029,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,50037,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,50027,50028,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,50024,50025],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgm": "23-1.mp3",
    "color": [
        0,
        0,
        0,
        0.7
    ]
}