main.floors.MT63=
{
    "floorId": "MT63",
    "title": "毒雾沼泽",
    "name": "毒雾沼泽",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 100,
    "defaultGround": "grass2",
    "bgm": "23-1.mp3",
    "color": [
        0,
        0,
        0,
        0.7
    ],
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        "\t[hero]右上方好像有个人被困住了。",
        "\t[熙枫,heroine]看穿着应该是\r[yellow]镇仙域\r[white]的人。她看起来暂时没有危险，不用着急，做好准备再去帮她吧。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "11,1": [
            {
                "type": "if",
                "condition": "flag:black_bee",
                "true": [
                    "\t[镇仙域少女,npc2]天哪，竟然有人来救我了！",
                    "\t[hero]深更半夜的还呆在这个地方，你也不是一般人啊。",
                    "\t[镇仙域少女,npc2]哪里，我本是来这里采集毒雾结晶的，却不料所需的道具数量算错了，拿到结晶之后被困在了这里。",
                    "\t[镇仙域少女,npc2]而且这里的毒雾结晶数量太少了，根本赚不回我消耗掉的道具成本……唉，这回亏大了。",
                    "\t[熙枫,heroine]（如果能赚回来，那些商人早就自己用道具取走这些结晶了，何必花钱收购）",
                    "\t[镇仙域少女,npc2]虽然我很感谢你，但是我现在身上除了一块毒雾结晶什么都没有……",
                    "\t[hero]算了，那块晶体你自己留着吧，我就当做好事攒人品了。",
                    "\t[镇仙域少女,npc2]哇你真是个好人，再见~",
                    "\t[熙枫,heroine]（等等，问问她那个……）",
                    {
                        "type": "sleep",
                        "time": 500
                    },
                    "\t[hero]等一下，我有一个问题想问你。",
                    "\t[镇仙域少女,npc2]嗯？",
                    "\t[hero]你们平时所用的消耗品，都是在商域买的吗？感觉那里东西好贵啊，我都用不起多少。",
                    "\t[镇仙域少女,npc2]当然啦……等等，原来你不是我镇仙域的人，可是看你穿着这么讲究，也不像权圣教那帮赤膊大汉啊……",
                    {
                        "type": "animate",
                        "name": "wuyu",
                        "loc": "hero"
                    },
                    "\t[hero]我也不是权圣教的人，只是一介散修而已。",
                    "\t[镇仙域少女,npc2]原来如此，那我就给你介绍一下吧。",
                    "\t[镇仙域少女,npc2]虽然镇仙域的理念是多用消耗品，但也不是什么时候都随便挥霍的。我们平日里很节俭的，就为了攒钱应对关键时刻呢。",
                    "\t[镇仙域少女,npc2]不像权圣教那些人，宁死也不借用外物之力，带着一堆钱进坟墓，真是愚蠢。",
                    "\t[镇仙域少女,npc2]当然，商域的东西对于寻常弟子而言确实不便宜，不过老牌弟子们可以凭借强悍的实力，深入到各种危险地带帮他们收集资源来赚钱。",
                    "\t[镇仙域少女,npc2]只要抱上这些大腿就会发现，商域的商品其实很便宜的，他们还经常抱怨钱多得没地方花呢。",
                    {
                        "type": "animate",
                        "name": "han",
                        "loc": "hero"
                    },
                    "\t[hero]那，两大宗派除了理念不同之外，是不是修炼的技能也是各有特色？",
                    "\t[镇仙域少女,npc2]那是当然，权圣教那些傻大个就知道钻研战斗技巧，而我们则精于以非战斗的方式达成目的。",
                    "\t[镇仙域少女,npc2]看你这样子应该是对我镇仙域的技能有兴趣吧？我教你一个最简单的，作为你救我的报答好啦。",
                    {
                        "type": "setValue",
                        "name": "item:smallJump",
                        "value": "1"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:smallJump_cost",
                        "value": "50"
                    },
                    "\t[hero]多谢！",
                    "\t[镇仙域少女,npc2]客气。我先走啦，拜拜~",
                    {
                        "type": "hide",
                        "time": 500
                    },
                    {
                        "type": "sleep",
                        "time": 500
                    },
                    "\t[hero]这个技能……向前跳跃一格，难怪商人那里只卖跳两格的跳跃靴。",
                    "\t[熙枫,heroine]嗯，就是这个技能，非常实用，不仅可以穿越白骨山洞的悬崖，还可以反制\r[yellow]阻击、夹击\r[white]等技能。我们也走吧。"
                ],
                "false": [
                    "\t[镇仙域弟子,npc2]……"
                ]
            }
        ]
    },
    "changeFloor": {
        "0,6": {
            "floorId": "MT62",
            "loc": [
                12,
                3
            ],
            "time": 0
        }
    },
    "afterBattle": {
        "10,2": [
            {
                "type": "setValue",
                "name": "flag:black_bee",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154, 30, 28,235,50011,  0,445,454,20011, 22,20011,135,154],
    [154,50011,20012,  0,256,  0,50011, 28,50011,  0,484,  0,154],
    [154,454,50011, 29,50011,454,50019,231,20011,50011,  0,20011,154],
    [154, 27,50019,  0, 81,  0, 28,  0,  0,445,  0,448,154],
    [154,235,  0,  0,50019,50019,50019,231,50018,50018,50018,  0,154],
    [ 92,  0,50019,235,  0,454,50019, 27, 81, 30,  0,454,154],
    [154,256,50011,50018, 29,  0, 81,454,50011,467,20012,20012,154],
    [154, 27,  0,50011,467,50011,231,50011, 27,  0,  0,  0,154],
    [154,467,454,50011,  0, 28,  0, 30,  0,454,20012,235,154],
    [154, 28,50011,50018,50019,  0,231,  0,20012,20012,20012,  0,154],
    [154,454,50019,454, 28,448,50011,  0,467, 27,  0,458,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154]
],
    "bgmap": [

],
    "fgmap": [

],
    "weather": [
        "fog",
        3
    ]
}