main.floors.MT64=
{
    "floorId": "MT64",
    "title": "毒雾沼泽",
    "name": "毒雾沼泽",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 100,
    "defaultGround": "grass2",
    "bgm": "23-1.mp3",
    "color": [
        0,
        0,
        0,
        0.7
    ],
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        "\t[熙枫,heroine]这里往下走。",
        {
            "type": "if",
            "condition": "flag:hard < 3",
            "true": [
                "\t[hero]谔谔，下去的路被堵住了。",
                "\t[熙枫,heroine]它的特技，我们可以利用一下。"
            ],
            "false": [
                "\t[hero]好的。"
            ]
        },
        {
            "type": "setValue",
            "name": "flag:arrived_64",
            "value": "1"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,12": {
            "floorId": "MT62",
            "loc": [
                2,
                0
            ],
            "time": 0
        },
        "12,3": {
            "floorId": "MT65",
            "loc": [
                0,
                10
            ],
            "time": 0
        },
        "0,6": {
            "floorId": "MT66",
            "loc": [
                12,
                6
            ],
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
    [151,151,151,151,151,151,151,151,151,151,151,151,151],
    [154,154,154,154,  0,  0,  0,154,154,154,154,154,154],
    [154,154,154,154,  0,  0,  0,154,154,154,154,154,154],
    [154,154,154,  0,  0,  0,  0,154,154,  0,  0,  0, 94],
    [154,154,  0,  0,  0,  0,  0,154,154,154,154,442,154],
    [154,  0,  0,  0,  0,  0,  0,154,154,154,154,  0,154],
    [ 92,  0,  0,  0,  0,  0,  0,154,154,  0,  0,  0,154],
    [154,  0,  0,  0,  0,  0,  0,154,154,  0,  0,  0,154],
    [154,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,154],
    [154,442,20011,20011,20011,  0,  0,  0,20011,20011,20011,444,154],
    [154,352,  0,350,  0, 81,441, 81,  0,349,  0,352,154],
    [154,  0,455,  0,20011,20011,  0,20011,20011,  0,454,  0,154],
    [154,154,154,154,154,154, 93,154,154,154,154,154,154]
],
    "bgmap": [

],
    "fgmap": [

],
    "weather": [
        "fog",
        3
    ]
}