main.floors.MT70=
{
    "floorId": "MT70",
    "title": "毒雾沼泽",
    "name": "毒雾沼泽",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 100,
    "defaultGround": "grass2",
    "bgm": "23-1.mp3",
    "color": [
        0,
        0,
        0,
        0.7
    ],
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,12": {
            "floorId": "MT6A",
            "loc": [
                6,
                0
            ],
            "time": 0
        }
    },
    "afterBattle": {
        "6,2": [
            {
                "type": "openDoor",
                "loc": [
                    5,
                    1
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    7,
                    1
                ]
            }
        ]
    },
    "afterGetItem": {
        "6,1": [
            {
                "type": "if",
                "condition": "core.itemCount('redKey') == 1",
                "true": [
                    "\t[hero]红色的钥匙？",
                    "\t[熙枫,heroine]应该是两大宗派有意放置在这些强大的怪物身后的，红色的钥匙是实力的证明，只有足够强大者，才能凭借它们进入\r[yellow]月光大道\r[white]去突破血海境界。",
                    "\t[hero]那什么月光大道，里面的怪物都很强吧？",
                    "\t[熙枫,heroine]毕竟是专门给红海巅峰准备的修炼场所。现在还没必要急着去那里，先把其他地方的怪物都清理了再去吧。"
                ],
                "false": []
            }
        ]
    },
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
    [151,151,151,151,151,151,151,151,151,151,151,151,151],
    [151,360,358,359,357, 85, 23, 85,357,359,358,360,151],
    [151,458,457,151,151,151,453,151,151,151,457,458,151],
    [151, 82,151,151,353,443,  0,443,354,151,151, 82,151],
    [151,356,354,151,  0,151,151,151,  0,151,353,356,151],
    [151,  0,443,151, 81,151,443,151,451,151,443,  0,151],
    [151, 81,355,449,  0,  0,355,  0,  0,449,355, 81,151],
    [151,  0,443,151,451,151,443,151, 81,151,443,  0,151],
    [151,455,353,151,  0,151,151,151,  0,151,354,455,151],
    [151, 81,151,151,354,443,  0,443,353,151,151, 81,151],
    [151,454,  0,151, 81,151,468,151, 81,151,  0,454,151],
    [151,489, 21,450,  0,  0,  0,  0,  0,450, 21,490,151],
    [151,151,151,151,151,151, 93,151,151,151,151,151,151]
],
    "bgmap": [

],
    "fgmap": [

],
    "weather": [
        "fog",
        8
    ]
}