main.floors.MT71=
{
    "floorId": "MT71",
    "title": "黑暗森林",
    "name": "黑暗森林",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 100,
    "defaultGround": "grass2",
    "firstArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.setFlag('bgLight', []);\ncore.drawMap();\n}"
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[熙枫,heroine]黑暗森林里面有不少怪物可以根据你\r[yellow]当前的生命值\r造成伤害，不过只要先去其他地方压低生命值，它们的技能就作用不大了。",
        "\t[熙枫,heroine]但如果生命值压得太低就打不过怪物了，所以商人那里卖的\r[yellow]便携式血瓶\r可能会在这里派上用场。"
    ],
    "eachArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.setFlag('bgLight', []);\ncore.drawMap();\n}"
        }
    ],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "12,2": {
            "floorId": "Chap3_m",
            "loc": [
                3,
                8
            ],
            "time": 500
        },
        "3,0": {
            "floorId": "MT72",
            "loc": [
                9,
                12
            ],
            "time": 0
        },
        "0,8": {
            "floorId": "MT75",
            "loc": [
                12,
                3
            ],
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {
        "10,6": [
            {
                "type": "addValue",
                "name": "item:coin",
                "value": "2000"
            },
            "\t[系统提示]获得2000金币。",
            {
                "type": "sleep",
                "time": 500
            },
            "\t[hero]这野外还能捡到钱的？",
            "\t[熙枫,heroine]这些钱说不定是哪个怨魂生前的财产。",
            "\t[hero]啊？这些怪物还有一些是人变来的？",
            "\t[熙枫,heroine]毕竟修炼之路对于大多数人而言都是极为残酷的，你以为都跟你一样打打怪就升级了？",
            "\t[hero]突然感觉这地方有点……那啥……"
        ]
    },
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
    [151,151,151, 91,151,151,151,151,151,151,151,151,151],
    [151,  0, 30,  0, 29, 81,  0, 28,151, 27,151,  0,  0],
    [151, 28,218,380,431,151,151,431,151,  0,428,  0, 94],
    [151,  0,151,  0,  0,454,  0, 30,  0, 29,151,  0,  0],
    [151, 27,151,151,151,218,  0,151,428,151,151, 82,151],
    [151,  0,432,  0,151,151,  0,454,  0,151,  0,431,  0],
    [151,151,151, 30,  0,151,428,151,431,151, 63,151, 21],
    [151,  0,428,  0,454,  0,  0,151,  0,241,  0,151,  0],
    [ 92,  0,151,151,151,218,  0, 28,  0,151,354,475,380],
    [151, 30,151,  0, 27,  0,151,428,151,151,151,151,151],
    [151,  0,475,380,151,454, 81, 27,  0,475, 28,151,380],
    [151, 28,151,  0, 29,  0,432,  0, 30,151, 29,429,349],
    [151,151,151,151,151,151,151,151,151,151,151,151,151]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "1-3.mp3",
    "color": [
        0,
        0,
        0,
        0.7
    ]
}