main.floors.MT84=
{
    "floorId": "MT84",
    "title": "白骨山洞",
    "name": "白骨山洞",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 100,
    "defaultGround": "soil",
    "bgm": "3-5.mp3",
    "color": [
        0,
        0,
        0,
        0.7
    ],
    "firstArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.setFlag('bgLight', [\n\t[304, 208, 200]\n]);\ncore.drawMap();\n}"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "changePos",
            "direction": "left"
        },
        "\t[hero]\b[up,hero]咦，悬崖下面好像有个人？",
        "\t[权圣教壮汉,N485]\b[up,2,11]这位兄弟帮帮我，我上不去了，给俺带一个\r[yellow]跳跃靴\r[white]过来吧，谢谢了。",
        {
            "type": "animate",
            "name": "wuyu",
            "loc": "hero"
        },
        "\t[hero]\b[up,hero]老哥你没有跳跃靴是怎么下去的啊？",
        "\t[权圣教壮汉,N485]\b[up,2,11]当然是用跳跃靴跳下来的啊，俺看这下面有怪物，就偷偷去镇仙域那边的商人买了个跳跃靴，哪想到一个靴子只能用一次，坑爹啊！",
        {
            "type": "animate",
            "name": "han",
            "loc": "hero"
        },
        "\t[hero]\b[up,hero]老哥挺住，我这就来帮你。"
    ],
    "eachArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.setFlag('bgLight', [\n\t[304, 208, 200]\n]);\ncore.drawMap();\n}"
        }
    ],
    "parallelDo": "",
    "events": {
        "2,11": [
            {
                "type": "if",
                "condition": "core.hasItem('jumpShoes')",
                "true": [
                    "\t[hero]老哥，你要的跳跃靴我给你带来了。",
                    "\t[权圣教壮汉,N485]卧槽太谢谢你了。",
                    {
                        "type": "addValue",
                        "name": "item:jumpShoes",
                        "value": "-1"
                    },
                    "\t[权圣教壮汉,N485]俺身上没什么好东西可以拿来报答你，不过俺刚才看你冲锋过来打这些骷髅，倒是有点意思，不介意俺指点一下吧？",
                    "\t[hero]……请讲。",
                    "\t[权圣教壮汉,N485]俺看你击败一个骷髅之后，冲锋势头不减，不过权圣教最擅长正面相斗之术，俺可以让你更进一步，击败一个敌人后冲锋势头更盛！",
                    {
                        "type": "setValue",
                        "name": "item:c_charge",
                        "value": "1"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:charge2_battle_extra",
                        "value": "3"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:charge2_battle_extra_max",
                        "value": "9"
                    },
                    "\t[hero]明白了，多谢老哥指点。",
                    "\t[权圣教壮汉,N485]兄弟客气，这样俺俩互不相欠，俺先撤了。",
                    "\t[hero]老哥等一下，我有一个问题想问。",
                    "\t[权圣教壮汉,N485]兄弟尽管问，俺尽量回答。",
                    "\t[hero]你们权圣教的人不是不屑于用镇仙域的消耗品吗，怎么你就买了个跳跃靴跳下来了呢？",
                    "\t[hero]按你们的说法，这个叫“咸鱼”行为吧。",
                    "\t[权圣教壮汉,N485]（满头大汗）这……清怪不能算咸……清怪！……清理怪物的事情，能算咸吗？",
                    {
                        "type": "animate",
                        "name": "han",
                        "loc": "hero"
                    },
                    "\t[权圣教壮汉,N485]兄弟没别的事了吧，俺先撤了。",
                    {
                        "type": "setBlock",
                        "number": "N486",
                        "loc": [
                            2,
                            11
                        ]
                    },
                    {
                        "type": "jump",
                        "from": [
                            2,
                            11
                        ],
                        "to": [
                            4,
                            11
                        ],
                        "time": 300,
                        "keep": true
                    },
                    {
                        "type": "move",
                        "loc": [
                            4,
                            11
                        ],
                        "time": 200,
                        "steps": [
                            "right",
                            "down"
                        ]
                    },
                    {
                        "type": "sleep",
                        "time": 500
                    },
                    "\t[hero]这权圣教的战斗技巧确实有点东西……",
                    "\t[熙枫,heroine]看来可怜的便携小莱姆又多了一个用途……"
                ],
                "false": [
                    "\t[hero]老哥，你要的跳跃靴我给你带来了……哎等等我跳跃靴呢？",
                    {
                        "type": "if",
                        "condition": "switch:A",
                        "true": [
                            "\t[权圣教壮汉,N485]兄弟你可真是个谐星……"
                        ],
                        "false": [
                            "\t[权圣教壮汉,N485]卧槽这下完蛋了，俺俩只能一起在这等人救援了。",
                            {
                                "type": "if",
                                "condition": "core.hasItem('smallJump')",
                                "true": [
                                    "\t[hero]没关系，我掌握一个跳跃技能，我能上去。老哥你要不也学一下，很简单的。",
                                    "\t[权圣教壮汉,N485]啥？还有这种技能？俺学学看。",
                                    {
                                        "type": "sleep",
                                        "time": 500
                                    },
                                    "一段时间后。",
                                    {
                                        "type": "sleep",
                                        "time": 500
                                    },
                                    "\t[权圣教壮汉,N485]难难难，直接难，太难了。这技能也太复杂了，根本学不会。",
                                    {
                                        "type": "animate",
                                        "name": "wuyu",
                                        "loc": "hero"
                                    },
                                    "\t[hero]这……我这就回去给你带跳跃靴过来……",
                                    {
                                        "type": "setValue",
                                        "name": "switch:A",
                                        "value": "1"
                                    }
                                ],
                                "false": [
                                    {
                                        "type": "animate",
                                        "name": "wuyu",
                                        "loc": "hero"
                                    },
                                    {
                                        "type": "setValue",
                                        "name": "switch:A",
                                        "value": "1"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "5,12": {
            "floorId": "MT82",
            "loc": [
                5,
                0
            ],
            "time": 0
        },
        "0,0": {
            "floorId": "MT85",
            "loc": [
                12,
                9
            ],
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {
        "0,5": [
            "right"
        ],
        "0,6": [
            "right"
        ],
        "0,7": [
            "right"
        ],
        "9,11": [
            "right"
        ],
        "9,12": [
            "right"
        ],
        "5,0": [
            "right"
        ],
        "3,11": [
            "right"
        ],
        "3,12": [
            "right"
        ],
        "6,0": [
            "left",
            "down"
        ],
        "7,0": [
            "down"
        ],
        "8,0": [
            "down"
        ],
        "9,0": [
            "down"
        ],
        "10,0": [
            "down"
        ],
        "11,0": [
            "down"
        ],
        "12,0": [
            "down"
        ],
        "1,6": [
            "left"
        ],
        "1,5": [
            "left"
        ],
        "4,11": [
            "left"
        ],
        "4,12": [
            "left"
        ],
        "10,11": [
            "left"
        ],
        "10,12": [
            "left"
        ],
        "6,1": [
            "up"
        ],
        "9,1": [
            "up"
        ],
        "10,1": [
            "up"
        ],
        "11,1": [
            "up"
        ],
        "12,1": [
            "up"
        ],
        "2,8": [
            "left"
        ],
        "1,7": [
            "left"
        ]
    },
    "map": [
    [ 92,  0,455,320,349,454, 22,237,455,349,  0,320,320],
    [320,471,350,  0,234,  0,234,351,  0,234,454,352,237],
    [380,  0,320,320,320,320,320,320,320,320, 81,320,352],
    [ 17,352,  0,446,350,  0,439,  0,349,234,  0,320,237],
    [ 17, 81,320,320,320,320,320,320,320,320,351, 81,380],
    [  0,  0, 21,234,349,  0,439,  0,350,446,  0,320,237],
    [  0,439,320,320,320,320,380,320,  0,320,352,320,349],
    [434,351,  0,350,446,  0,320,320,446,80029,320,351,350],
    [234, 17,455,  0,320,455, 81,349,352,455, 82,456, 17],
    [349, 17, 17, 17,351,  0,349, 17, 17, 17,  0, 17, 17],
    [352, 17, 17, 17,320,439,  0, 17, 17, 17,  0, 17, 17],
    [234,320,486,455,  0,  0, 82,353,  0, 21,237,351,380],
    [350,351,263,455,  0, 93,  0,437,356,  0,  0,350,455]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,80047,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,80068,80038,80038,80038,80038,80038,80038,80039],
    [80054,80075,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80047],
    [80057,80045,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80047],
    [80065,80045,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80047],
    [  0,80045,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80047],
    [  0,80045,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80047],
    [  0,80045,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80047],
    [  0,80053,80054,80054,80075,  0,  0,80054,80054,80054,80183,80054,80055],
    [  0,80056,80057,80057,80045,  0,80153,80105,80057,80057,80191,80057,80058],
    [  0,80064,80065,80065,80045,  0,80153,80065,80065,80065,80191,80065,80066],
    [  0,  0,  0,  0,80045,  0,80068,80038,80038,80039,80199,  0,  0],
    [  0,  0,  0,  0,80045,  0,  0,  0,  0,80047,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,80021,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
]
}