main.floors.MT91_2=
{
    "floorId": "MT91_2",
    "title": "回忆",
    "name": "回忆",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "item_ratio": 1,
    "defaultGround": "ground",
    "bgm": "5-6.mp3",
    "weather": [
        "fog",
        10
    ],
    "firstArrive": [
        "\t[hero]这……这里又是哪？",
        "\t[hero]熙枫？",
        {
            "type": "jumpHero",
            "loc": [
                7,
                6
            ],
            "time": 500
        },
        {
            "type": "moveHero",
            "time": 100,
            "steps": [
                "up",
                "up"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "animate",
            "name": "wuyu",
            "loc": "hero"
        },
        {
            "type": "changePos",
            "direction": "down"
        },
        "\t[hero]呃，好像只是个虚影……",
        "\t[hero]这到底是……",
        "\t[瘦弱老者,N501]\b[down,5,5]熙枫。",
        "\t[hero]这瘦弱老者，我一眼就能看出他是红海低阶的境界……我好像记得熙枫曾经说过，这等实力在偏远地带已经足以称霸了。",
        "\t[熙枫,heroine]\b[down,7,5]父王，这么晚了是有什么事情吗？",
        "\t[国王,N501]\b[down,5,5]祝贺你晋入蓝海境界。趁着高兴的时候，有一件比较严肃的事情该跟你讲讲了。",
        "\t[国王,N501]\b[down,5,5]你应该知道，我年轻时清心寡欲、刻苦修炼，再加上有特别的奇遇，才在中年勉强突破至红海境界，建立起我\r[yellow]日暮王朝\r[white]，周边诸多蓝海巅峰所领衔的小国，都臣服于我们。",
        "\t[国王,N501]\b[down,5,5]但是，我无法在红海之路上更进一步了，这意味着我的寿命所剩不是很多了。",
        "\t[熙枫,heroine]\b[down,7,5]父亲……",
        "\t[国王,N501]\b[down,5,5]不用担心我，能够达到红海境界并成为一国之主，我此生无憾，只是，我不希望等我死后你因此而受苦。",
        "\t[国王,N501]\b[down,5,5]毕竟，要说我这辈子犯的最大的错误，便是单身到中年，建立王朝之后才只生下你一个孩子。",
        "\t[熙枫,heroine]\b[down,7,5]我明白……虽然我一直生活在优越的环境中，但我也很清楚我应该肩负的责任。",
        "\t[国王,N501]\b[down,5,5]不，你身上没有什么责任，我只希望你能活得幸福、快乐。",
        "\t[熙枫,heroine]\b[down,7,5]……您的意思是？",
        "\t[国王,N501]\b[down,5,5]没错，我不想强求你接管这个王朝，甚至，我不希望你接管这个王朝。",
        "\t[国王,N501]\b[down,5,5]踏入红海境界之后，我对这个世界也有了更多的认知，我知道，这王朝其实算不了什么，在这个世界上，绝对的实力才是真理。",
        "\t[国王,N501]\b[down,5,5]这个世界很大，比我强的人数不胜数，而他们生活在一个更加精彩的世界，根本不屑于像我这样被束缚在一个小小的王朝里。",
        "\t[国王,N501]\b[down,5,5]其实，这些年我管理日暮王朝，也让我认清了自己，我是个适合潜心修炼的人，而不是个适合管理王朝的人。若不是我年岁已大，我还会像年轻时那样出去打拼，磨练自己。",
        "\t[国王,N501]\b[down,5,5]我死后，周边那些小国必然不会再臣服。我知道你对这种权力斗争没有什么兴趣，大可随他们去闹，这日暮王朝灭了也就灭了。",
        "\t[hero]（这老头还真是豁达，对自己亲手建立的王朝都这么狠，看来也是一代枭雄）",
        "\t[国王,N501]\b[down,5,5]但是，你必须有足以自保的力量，至少能够不怕那些小国的国主。这意味着你起码要达到蓝海九阶。",
        "\t[熙枫,heroine]\b[down,7,5]我明白了。我现在才刚刚达到蓝海一阶，以后的修炼不会放松的。",
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    5
                ]
            ],
            "time": 1000,
            "async": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    5
                ]
            ],
            "time": 1000
        },
        {
            "type": "changeFloor",
            "floorId": "MT92",
            "loc": [
                6,
                12
            ],
            "direction": "up",
            "time": 500
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,509,  0,504,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [

],
    "fgmap": [

]
}