main.floors.MT93_2=
{
    "floorId": "MT93_2",
    "title": "回忆",
    "name": "回忆",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "item_ratio": 1,
    "defaultGround": "ground",
    "bgm": "5-6.mp3",
    "weather": [
        "fog",
        6
    ],
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        "\t[hero]又是这位老者……熙枫的父亲。看得出来，他满是皱纹的面庞上带着抑制不住的喜悦。",
        "\t[国王,N501]\b[down,5,5]祝贺你晋入红海境界。不得不说，你的升级速度实在是太惊人了。",
        "\t[国王,N501]\b[down,5,5]这里没有别人，能否告诉我背后的原因？",
        "\t[熙枫,heroine]\b[down,7,5]有一天出门我遇到了一只奇怪的小黄鸡，我觉得它挺可爱的，就走过去看它，然后它就……冲进了我体内。自那以后，我就发现自己升级变得特别容易。",
        "\t[熙枫,heroine]\b[down,7,5]父亲，您知道这是怎么回事吗？",
        "\t[国王,N501]\b[down,5,5]……不知道。我平日搜集各种奇闻轶事，对这种事情也是闻所未闻。",
        "\t[国王,N501]\b[down,5,5]如今你已经完全不怕那些小国的国主了。但是，你的这种升级速度，可能会引来更加强大的敌人。那黄鸡之力，绝对是极为恐怖的存在，一旦暴露，恐怕就算是红海巅峰乃至血海境界的强者都会不要脸地疯抢。",
        "\t[国王,N501]\b[down,5,5]你现在有两个选择：一是隐藏自己的实力来自保；二是利用这次奇遇，突破到那传说中的血海境界！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[熙枫,heroine]\b[down,7,5]我听您的。",
        "\t[国王,N501]\b[down,5,5]哈哈哈，为父的想法你难道还不知道吗？",
        "\t[熙枫,heroine]\b[down,7,5]……突破血海。",
        "\t[国王,N501]\b[down,5,5]没错！你若是能生活在那更为精彩的世界，也算了却我一桩心愿了。",
        "\t[熙枫,heroine]\b[down,7,5]不愧是父亲您啊。但是，就算有这黄鸡之力，我也感觉红海低阶到红海中阶的差距极大……",
        "\t[国王,N501]\b[down,5,5]那是当然，红海境界想要进阶，必然要吸收红海之力，在这遍地蓝海乃至萌新生物的地方是不可能更进一步的。",
        "\t[国王,N501]\b[down,5,5]我知道有个地方，定能帮助你突破血海，只是你自己在外闯荡我还是有些不放心，虽然你如今境界和我一样，但你还小，没有见识过这个世界的残酷……",
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    5
                ]
            ],
            "time": 1000,
            "async": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    5
                ]
            ],
            "time": 1000
        },
        {
            "type": "changeFloor",
            "floorId": "MT94",
            "loc": [
                6,
                12
            ],
            "time": 500
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,509,  0,504,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [

],
    "fgmap": [

]
}