main.floors.MT95_2=
{
    "floorId": "MT95_2",
    "title": "回忆",
    "name": "回忆",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "item_ratio": 1,
    "defaultGround": "ground",
    "bgm": "5-6.mp3",
    "weather": [
        "fog",
        2
    ],
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        "熙枫对面站着一位气度不凡的中年男人。男人剑眉星目，不怒自威，衣服上绣着无数条鱼，这些鱼形状、大小完全相同，彼此之间既不重叠也不留一点空隙，十分精致。",
        "\t[hero]\b[up,hero]（这男人的境界我也看不透……这又是何方巨佬……）",
        {
            "type": "sleep",
            "time": 1000
        },
        "\t[熙枫,heroine]\b[down,7,5]拜见甄摩大长老，不知我何德何能有资格被您这样的大人物所注意到？",
        "\t[甄摩,N510]\b[down,5,5]我已经调查过你的情况了，表面上用了几个月就从红海低阶突破至红海巅峰，实际上甚至还在刻意隐藏自身实力，这几个境界突破对你来讲，连几个月都不用吧。",
        "\t[甄摩,N510]\b[down,5,5]此等升级速度，不说后无来者，但绝对是前无古人。获得了如此强大的能力还不骄不躁，知道藏拙，你这小女孩真是聪明得很。",
        "\t[熙枫,heroine]\b[down,7,5]大长老谬赞。不过匹夫无罪，怀璧其罪的道理，我还是懂的。",
        "\t[甄摩,N510]\b[down,5,5]你还不知道你这种力量是什么原理吧？",
        "\t[熙枫,heroine]\b[down,7,5]不知道，还请大长老指点。",
        "\t[甄摩,N510]\b[down,5,5]若是我所料不错，此乃\r[yellow]法则之力\r[white]。",
        "\t[甄摩,N510]\b[down,5,5]法则之力是血海之上的境界才能接触到的。我不知道你是如何获得这个机缘的，但你要明白，法则之力对于血海境界的人都有着极大的吸引力，你身怀法则之力的事情若是传出去，必然招致灾难。",
        "\t[熙枫,heroine]\b[down,7,5]我知道的，我不想暴露自己真实的升级速度的……但是我实在不忍心看着同伴们为我送命。",
        "大长老露出了一瞬笑容，随即又严肃了起来。",
        "\t[甄摩,N510]\b[down,5,5]我知道你很聪明，不过还是容我以过来人的地位说教一句，\r[red]心善是好事，但是太善良迟早要被这世道坑死\r[white]。",
        "\t[hero]\b[up,hero]（这……这句话！）",
        "\t[熙枫,heroine]\b[down,7,5]是，大长老。",
        "\t[甄摩,N510]\b[down,5,5]我镇仙域会尽量为你保守秘密，但也无法确保你这力量的信息不会传到其他人那里。",
        "\t[甄摩,N510]\b[down,5,5]按我的推算，虽然红海巅峰到血海初成之间差距极大，不过对你来讲应该也花不了多久。等你成就血海境界离开红海战场之后，你将体会到更加庞大、更加精彩，但也更加危险的世界——特别是你这种身怀奇遇的人，必定会遇到不择手段之辈对你动手。",
        "\t[甄摩,N510]\b[down,5,5]你的力量增长太快了，我担心你的心性无法配得上你的力量。世道险恶，请一定要小心。",
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    5
                ]
            ],
            "time": 1000,
            "async": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    5
                ]
            ],
            "time": 1000
        },
        {
            "type": "sleep",
            "time": 1000
        },
        "\t[hero]\b[up,hero]后面没有了吗？……",
        {
            "type": "sleep",
            "time": 1000
        },
        "\t[hero]\b[up,hero]心性……力量……我缺少的到底是哪样呢？",
        "\t[hero]\b[up,hero]熙枫无法对同伴见死不救，暴露自身实力，是心性不够。但是，如果她的力量足够强大，也不会落到现在的境地。",
        "\t[hero]\b[up,hero]而且，我的经历，毕竟是跟她不一样的。我缺少的，就是力量！能够保护自己的力量，能够保护她的力量，乃至于……",
        {
            "type": "vibrate",
            "time": 1000
        },
        "\t[hero]等等，我好像又要被传送走了，而且这次好像不一样……",
        {
            "type": "changeFloor",
            "floorId": "MT96",
            "loc": [
                6,
                12
            ],
            "direction": "up",
            "time": 500
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
    [  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4],
    [  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4],
    [  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4],
    [  4,  4,  4,  0,  0,  0,  0,  0,  0,  0,  4,  4,  4],
    [  4,  4,  4,  0,  0,  0,  0,  0,  0,  0,  4,  4,  4],
    [  4,  4,  4,  0,  0,511,  0,504,  0,  0,  4,  4,  4],
    [  4,  4,  4,  0,  0,  0,  0,  0,  0,  0,  4,  4,  4],
    [  4,  4,  4,  0,  0,  0,  0,  0,  0,  0,  4,  4,  4],
    [  4,  4,  4,  0,  0,  0,  0,  0,  0,  0,  4,  4,  4],
    [  4,  4,  4,  0,  0,  0,  0,  0,  0,  0,  4,  4,  4],
    [  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4],
    [  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4],
    [  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4]
],
    "bgmap": [

],
    "fgmap": [

]
}