main.floors.MT96=
{
    "floorId": "MT96",
    "title": "刀剑翠域",
    "name": "刀剑翠域",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 1,
    "defaultGround": "grass2",
    "bgm": "6-7.mp3",
    "color": null,
    "weather": null,
    "firstArrive": [
        {
            "type": "setValue",
            "name": "flag:darkRatio",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "flag:heroLight",
            "value": "0"
        },
        {
            "type": "sleep",
            "time": 1000
        },
        "\t[hero]好亮……好绿……这里似乎和前面不太一样……",
        "\t[hero]刚才那些，都是熙枫的回忆吧……这里，又是哪？",
        "\t[???]欢迎来到刀剑翠域，第9527位想要突破血海的挑战者。",
        "\t[hero]（这个声音……是从楼上传来的）",
        "\t[hero]等一下，我并不知道我为什么会来到这里……",
        "\t[???]在你之前的9526人，通通都失败了。但是，你已经没有退路了。你唯一的选择便是来到顶层，见到我，你的一切疑问都会迎刃而解。",
        {
            "type": "sleep",
            "time": 1000
        },
        "\t[hero]……",
        "\t[hero]这不对劲，之前的一切都太诡异了，熙枫的记忆接连展现在我眼前，还有那种虚浮的力量，来了又去，去了又来……",
        "\t[hero]这家伙口气倒是够大，竟然说“一切疑问”都会迎刃而解，那我真是迫不及待了。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,0": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
    [156,156,156,156,156,156, 87,156,156,156,156,156,156],
    [156,  0,  0,  0,  0,  0,  0,  0,156,  0,  0,  0,156],
    [156,  0,  0,156,  0,156,  0,156,156,  0,  0,  0,156],
    [156,  0,  0,  0,  0,  0,  0,  0,  0,156,  0,156,156],
    [156,156,156,156,  0,156,156,  0,  0,  0,  0,  0,156],
    [156,  0,  0,156,  0,  0,  0,  0,  0,  0,  0,  0,156],
    [156,  0,  0,  0,  0,  0,  0,  0,156,  0,  0,  0,156],
    [156,  0,  0,156,  0,  0,156,  0,  0,156,  0,  0,156],
    [156,  0,  0,156,  0,  0,  0,156,156,  0,156,  0,156],
    [156,  0,156,  0,  0,  0,  0,  0,  0,  0,  0,  0,156],
    [156,  0,  0,  0,  0,156,  0,  0,  0,  0,  0,156,156],
    [156,  0,  0,  0,  0,  0,  0,156,  0,156,  0,  0,156],
    [156,156,156,156,156,156,  0,156,156,156,156,156,156]
],
    "bgmap": [

],
    "fgmap": [

]
}