main.floors.MT99=
{
    "floorId": "MT99",
    "title": "刀剑翠域",
    "name": "刀剑翠域",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 1,
    "defaultGround": "grass2",
    "bgm": "6-7.mp3",
    "color": null,
    "weather": null,
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "12,6": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,12": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,  0,  0,  0,156,  0,  0,156,  0,  0,  0,  0,156],
    [156,  0,  0,  0,156,  0, 83,  0,  0,156,  0,  0,156],
    [156,  0,  0,  0,  0,  0,  0, 83,  0,156,  0,156,156],
    [156,  0,156,156,  0,  0,  0,156,  0,  0,  0,  0,156],
    [156,  0,  0,156,  0,156,  0,156,  0,  0,  0,  0,156],
    [156,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 88],
    [156,  0,  0,  0,156,  0,156,  0,  0,156,  0,  0,156],
    [156,  0,  0,  0,  0,156,  0,  0,  0,  0,  0,  0,156],
    [156,  0,  0,  0,  0,  0,  0,156,  0,  0,  0,  0,156],
    [156,156,  0,  0,156,  0,  0,  0,156,156,156,  0,156],
    [156,  0,156,  0,  0,156,  0,  0,  0,  0,  0,  0,156],
    [156,156,156,156,156,156, 87,156,156,156,156,156,156]
],
    "bgmap": [

],
    "fgmap": [

]
}